In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://retail_user:retail_password@localhost:5432/retail_db

env: DATABASE_URL=postgresql://retail_user:retail_password@localhost:5432/retail_db

We use WHERE clause to filter the data.

All comparison operators such as =, !=, >, <, <=, >= etc can be used to compare a column or expression or literal with another column or expression or literal.

We can use operators such as LIKE with % or ~ with regular expressions for pattern matching.

Boolean OR and AND can be performed when we want to apply multiple conditions.

Get all orders with order_status equals to COMPLETE or CLOSED. We can also use IN operator.

Get all orders from month 2014 January with order_status equals to COMPLETE or CLOSED

We can also use BETWEEN along with AND to compare a column or expression against range of values.

We need to use IS NULL and IS NOT NULL to compare against null values.

In [3]:
%%sql
SELECT * FROM orders
WHERE order_status = 'COMPLETE'
LIMIT 10;

10 rows affected.

[(3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (15, datetime.datetime(2013, 7, 25, 0, 0), 2568, 'COMPLETE'),
 (17, datetime.datetime(2013, 7, 25, 0, 0), 2667, 'COMPLETE'),
 (22, datetime.datetime(2013, 7, 25, 0, 0), 333, 'COMPLETE'),
 (26, datetime.datetime(2013, 7, 25, 0, 0), 7562, 'COMPLETE'),
 (28, datetime.datetime(2013, 7, 25, 0, 0), 656, 'COMPLETE'),
 (32, datetime.datetime(2013, 7, 25, 0, 0), 3960, 'COMPLETE')]

In [4]:
%sql SELECT count(1) FROM orders

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(68883,)]

In [5]:
%%sql 
SELECT count(1) 
FROM orders
WHERE order_status = 'COMPLETE';

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(22899,)]

In [6]:
%%sql 

SELECT DISTINCT order_status
FROM orders
WHERE order_status = 'COMPLETE'

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[('COMPLETE',)]

In [7]:
%%sql
SELECT DISTINCT order_status
FROM orders;

 * postgresql://retail_user:***@localhost:5432/retail_db
9 rows affected.

[('COMPLETE',),
 ('ON_HOLD',),
 ('PENDING_PAYMENT',),
 ('PENDING',),
 ('CLOSED',),
 ('CANCELED',),
 ('PROCESSING',),
 ('PAYMENT_REVIEW',),
 ('SUSPECTED_FRAUD',)]

In [8]:
%%sql 

SELECT * FROM orders 
WHERE order_status IN ('COMPLETE', 'CLOSED') 
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (12, datetime.datetime(2013, 7, 25, 0, 0), 1837, 'CLOSED'),
 (15, datetime.datetime(2013, 7, 25, 0, 0), 2568, 'COMPLETE'),
 (17, datetime.datetime(2013, 7, 25, 0, 0), 2667, 'COMPLETE'),
 (18, datetime.datetime(2013, 7, 25, 0, 0), 1205, 'CLOSED')]

In [9]:
%%sql

SELECT count(1)
FROM orders
WHERE order_status IN ('COMPLETE', 'CLOSED');

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(30455,)]

In [10]:
%%sql

SELECT count(1)
FROM orders
WHERE order_status = 'COMPLETE' OR order_status = 'CLOSED';

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(30455,)]

In [11]:
%%sql

SELECT * FROM orders
WHERE order_date = '2014-01-01'
LIMIT 3

 * postgresql://retail_user:***@localhost:5432/retail_db
3 rows affected.

[(25876, datetime.datetime(2014, 1, 1, 0, 0), 3414, 'PENDING_PAYMENT'),
 (25877, datetime.datetime(2014, 1, 1, 0, 0), 5549, 'PENDING_PAYMENT'),
 (25878, datetime.datetime(2014, 1, 1, 0, 0), 9084, 'PENDING')]

Queries with LIKE will not work on dates. the following query would fail:

%sql SELECT * FROM orders WHERE order_date LIKE '2014-01%' LIMIT 3

Instead use following:

In [12]:
%%sql

SELECT * FROM orders 
WHERE order_status IN ('COMPLETE', 'CLOSED')
    AND to_char(order_date, 'yyyy-MM-dd') LIKE '2014-01%'
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(25882, datetime.datetime(2014, 1, 1, 0, 0), 4598, 'COMPLETE'),
 (25888, datetime.datetime(2014, 1, 1, 0, 0), 6735, 'COMPLETE'),
 (25889, datetime.datetime(2014, 1, 1, 0, 0), 10045, 'COMPLETE'),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 3037, 'CLOSED'),
 (25895, datetime.datetime(2014, 1, 1, 0, 0), 1044, 'COMPLETE'),
 (25897, datetime.datetime(2014, 1, 1, 0, 0), 6405, 'COMPLETE'),
 (25898, datetime.datetime(2014, 1, 1, 0, 0), 3950, 'COMPLETE'),
 (25899, datetime.datetime(2014, 1, 1, 0, 0), 8068, 'CLOSED'),
 (25900, datetime.datetime(2014, 1, 1, 0, 0), 2382, 'CLOSED'),
 (25901, datetime.datetime(2014, 1, 1, 0, 0), 3099, 'COMPLETE')]

In [13]:
%%sql

SELECT count(1) FROM orders 
WHERE order_status IN ('COMPLETE', 'CLOSED')
    AND to_char(order_date, 'yyyy-MM-dd') LIKE '2014-01%'

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(2544,)]

In [14]:
%%sql

SELECT * FROM orders 
WHERE order_status IN ('COMPLETE', 'CLOSED')
    AND to_char(order_date, 'yyyy-MM') = '2014-01'
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(25882, datetime.datetime(2014, 1, 1, 0, 0), 4598, 'COMPLETE'),
 (25888, datetime.datetime(2014, 1, 1, 0, 0), 6735, 'COMPLETE'),
 (25889, datetime.datetime(2014, 1, 1, 0, 0), 10045, 'COMPLETE'),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 3037, 'CLOSED'),
 (25895, datetime.datetime(2014, 1, 1, 0, 0), 1044, 'COMPLETE'),
 (25897, datetime.datetime(2014, 1, 1, 0, 0), 6405, 'COMPLETE'),
 (25898, datetime.datetime(2014, 1, 1, 0, 0), 3950, 'COMPLETE'),
 (25899, datetime.datetime(2014, 1, 1, 0, 0), 8068, 'CLOSED'),
 (25900, datetime.datetime(2014, 1, 1, 0, 0), 2382, 'CLOSED'),
 (25901, datetime.datetime(2014, 1, 1, 0, 0), 3099, 'COMPLETE')]

In [15]:
%%sql

SELECT count(1) FROM orders 
WHERE order_status IN ('COMPLETE', 'CLOSED')
    AND to_char(order_date, 'yyyy-MM') = '2014-01'

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(2544,)]

In [16]:
%%sql

SELECT count(1) FROM orders 
WHERE order_status IN ('COMPLETE', 'CLOSED')
    AND to_char(order_date, 'yyyy-MM-dd') ~ '2014-01'

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(2544,)]

In [17]:
%%sql

SELECT count(1), min(order_date), max(order_date)
FROM orders
WHERE order_status IN ('COMPLETE','CLOSED')
AND order_date BETWEEN '2014-01-01' AND '2014-03-31'

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(7594, datetime.datetime(2014, 1, 1, 0, 0), datetime.datetime(2014, 3, 31, 0, 0))]

In [18]:
%%sql

SELECT count(1), min(order_date), max(order_date), count(DISTINCT order_date) 
FROM orders 
WHERE order_status IN ('COMPLETE', 'CLOSED')
    AND order_date BETWEEN '2014-01-01' AND '2014-03-31'

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(7594, datetime.datetime(2014, 1, 1, 0, 0), datetime.datetime(2014, 3, 31, 0, 0), 89)]

In [19]:
%%sql

SELECT DISTINCT order_date
FROM orders
WHERE to_char(order_date, 'yyyy-MM') LIKE '2014-03%'
ORDER BY order_date

 * postgresql://retail_user:***@localhost:5432/retail_db
30 rows affected.

[(datetime.datetime(2014, 3, 1, 0, 0),),
 (datetime.datetime(2014, 3, 2, 0, 0),),
 (datetime.datetime(2014, 3, 3, 0, 0),),
 (datetime.datetime(2014, 3, 4, 0, 0),),
 (datetime.datetime(2014, 3, 5, 0, 0),),
 (datetime.datetime(2014, 3, 6, 0, 0),),
 (datetime.datetime(2014, 3, 7, 0, 0),),
 (datetime.datetime(2014, 3, 8, 0, 0),),
 (datetime.datetime(2014, 3, 10, 0, 0),),
 (datetime.datetime(2014, 3, 11, 0, 0),),
 (datetime.datetime(2014, 3, 12, 0, 0),),
 (datetime.datetime(2014, 3, 13, 0, 0),),
 (datetime.datetime(2014, 3, 14, 0, 0),),
 (datetime.datetime(2014, 3, 15, 0, 0),),
 (datetime.datetime(2014, 3, 16, 0, 0),),
 (datetime.datetime(2014, 3, 17, 0, 0),),
 (datetime.datetime(2014, 3, 18, 0, 0),),
 (datetime.datetime(2014, 3, 19, 0, 0),),
 (datetime.datetime(2014, 3, 20, 0, 0),),
 (datetime.datetime(2014, 3, 21, 0, 0),),
 (datetime.datetime(2014, 3, 22, 0, 0),),
 (datetime.datetime(2014, 3, 23, 0, 0),),
 (datetime.datetime(2014, 3, 24, 0, 0),),
 (datetime.datetime(2014, 3, 25, 0, 0),),
 (datetime.datetime(2014, 3, 26, 0, 0),),
 (datetime.datetime(2014, 3, 27, 0, 0),),
 (datetime.datetime(2014, 3, 28, 0, 0),),
 (datetime.datetime(2014, 3, 29, 0, 0),),
 (datetime.datetime(2014, 3, 30, 0, 0),),
 (datetime.datetime(2014, 3, 31, 0, 0),)]

In [20]:
%%sql

DROP TABLE IF EXISTS users

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [21]:
%%sql

CREATE TABLE users (
    user_id SERIAL PRIMARY KEY,
    user_first_name VARCHAR(30) NOT NULL,
    user_last_name VARCHAR(30) NOT NULL,
    user_email_id VARCHAR(50) NOT NULL,
    user_email_validated BOOLEAN DEFAULT FALSE,
    user_password VARCHAR(200),
    user_role VARCHAR(1) NOT NULL DEFAULT 'U', --U and A
    is_active BOOLEAN DEFAULT FALSE,
    create_ts TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    last_updated_ts TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [22]:
%%sql

INSERT INTO users (user_first_name, user_last_name, user_email_id)
VALUES ('Donald', 'Duck', 'donald@duck.com')

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[]

In [23]:
%%sql

INSERT INTO users (user_first_name, user_last_name, user_email_id, user_role, is_active)
VALUES ('Mickey', 'Mouse', 'mickey@mouse.com', 'U', true)

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[]

In [24]:
%%sql

INSERT INTO users 
    (user_first_name, user_last_name, user_email_id, user_password, user_role, is_active) 
VALUES 
    ('Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', 'h9LAz7p7ub', 'U', true),
    ('Tobe', 'Lyness', 'tlyness1@paginegialle.it', 'oEofndp', 'U', true),
    ('Addie', 'Mesias', 'amesias2@twitpic.com', 'ih7Y69u56', 'U', true)

 * postgresql://retail_user:***@localhost:5432/retail_db
3 rows affected.

[]

In [25]:
%%sql

SELECT * FROM users

 * postgresql://retail_user:***@localhost:5432/retail_db
5 rows affected.

[(1, 'Donald', 'Duck', 'donald@duck.com', False, None, 'U', False, datetime.datetime(2021, 12, 9, 1, 52, 24, 900803), datetime.datetime(2021, 12, 9, 1, 52, 24, 900803)),
 (2, 'Mickey', 'Mouse', 'mickey@mouse.com', False, None, 'U', True, datetime.datetime(2021, 12, 9, 1, 52, 35, 320079), datetime.datetime(2021, 12, 9, 1, 52, 35, 320079)),
 (3, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', False, 'h9LAz7p7ub', 'U', True, datetime.datetime(2021, 12, 9, 1, 52, 42, 808009), datetime.datetime(2021, 12, 9, 1, 52, 42, 808009)),
 (4, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', False, 'oEofndp', 'U', True, datetime.datetime(2021, 12, 9, 1, 52, 42, 808009), datetime.datetime(2021, 12, 9, 1, 52, 42, 808009)),
 (5, 'Addie', 'Mesias', 'amesias2@twitpic.com', False, 'ih7Y69u56', 'U', True, datetime.datetime(2021, 12, 9, 1, 52, 42, 808009), datetime.datetime(2021, 12, 9, 1, 52, 42, 808009))]

In [26]:
%%sql

SELECT * FROM users
WHERE user_password = NULL

 * postgresql://retail_user:***@localhost:5432/retail_db
0 rows affected.

[]

The above query does not work as you can not do = NULL you must use IS NULL as shown below.

In [28]:
%sql SELECT * FROM users WHERE user_password IS NULL;

 * postgresql://retail_user:***@localhost:5432/retail_db
2 rows affected.

[(1, 'Donald', 'Duck', 'donald@duck.com', False, None, 'U', False, datetime.datetime(2021, 12, 9, 1, 52, 24, 900803), datetime.datetime(2021, 12, 9, 1, 52, 24, 900803)),
 (2, 'Mickey', 'Mouse', 'mickey@mouse.com', False, None, 'U', True, datetime.datetime(2021, 12, 9, 1, 52, 35, 320079), datetime.datetime(2021, 12, 9, 1, 52, 35, 320079))]

In [29]:
%sql SELECT * FROM users WHERE user_password IS NOT NULL;

 * postgresql://retail_user:***@localhost:5432/retail_db
3 rows affected.

[(3, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', False, 'h9LAz7p7ub', 'U', True, datetime.datetime(2021, 12, 9, 1, 52, 42, 808009), datetime.datetime(2021, 12, 9, 1, 52, 42, 808009)),
 (4, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', False, 'oEofndp', 'U', True, datetime.datetime(2021, 12, 9, 1, 52, 42, 808009), datetime.datetime(2021, 12, 9, 1, 52, 42, 808009)),
 (5, 'Addie', 'Mesias', 'amesias2@twitpic.com', False, 'ih7Y69u56', 'U', True, datetime.datetime(2021, 12, 9, 1, 52, 42, 808009), datetime.datetime(2021, 12, 9, 1, 52, 42, 808009))]